garyPenhook/PyAvrOCD/svd/atmega32hvb.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer/Counter, 16-bit</description>
      <baseAddress>0x00800035</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Counter Control Register</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSRSYNC</name>
              <description>Prescaler Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0A</name>
          <description>Output Compare Register A</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0A</name>
              <description>Output Compare 0 A bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0B</name>
          <description>Output Compare Register B</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0B</name>
              <description>Output Compare 0 B bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0A</name>
          <description>Timer/Counter 0 Control Register A</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM00</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICS0</name>
              <description>Input Capture Select</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICES0</name>
              <description>Input Capture Edge Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICNC0</name>
              <description>Input Capture Noise Canceler</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEN0</name>
              <description>Input Capture Mode Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCW0</name>
              <description>Timer/Counter Width</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0B</name>
          <description>Timer/Counter0 Control Register B</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS00</name>
              <description>Clock Select0 bit 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_STOPPED</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_NO_PRESCALING</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CS01</name>
              <description>Clock Select0 bit 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS02</name>
              <description>Clock Select0 bit 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT0</name>
          <description>Timer Counter 0 Bytes</description>
          <addressOffset>0x11</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCNT0</name>
              <description>Timer Counter 0 bits</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFR0</name>
          <description>Timer/Counter Interrupt Flag register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV0</name>
              <description>Timer/Counter0 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF0A</name>
              <description>Timer/Counter0 Output Compare Flag A</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF0B</name>
              <description>Timer/Counter0 Output Compare Flag B</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF0</name>
              <description>Timer/Counter 0 Input Capture Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK0</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE0</name>
              <description>Timer/Counter0 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE0A</name>
              <description>Timer/Counter0 Output Compare A Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE0B</name>
              <description>Timer/Counter0 Output Compare B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICIE0</name>
              <description>Timer/Counter n Input Capture Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
